<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/bootstrap@4.1.3/dist/css/bootstrap.min.css" integrity="sha384-MCw98/SFnGE8fJT3GXwEOngsV7Zt27NXFoaoApmYm81iuXoPkFOJwJ8ERdknLPMO" crossorigin="anonymous">
<script src="https://code.jquery.com/jquery-3.3.1.slim.min.js" integrity="sha384-q8i/X+965DzO0rT7abK41JStQIAqVgRVzpbzo5smXKp4YfRvH+8abtTE1Pi6jizo" crossorigin="anonymous"></script>
<script src="https://cdn.jsdelivr.net/npm/popper.js@1.14.3/dist/umd/popper.min.js" integrity="sha384-ZMP7rVo3mIykV+2+9J3UJ46jBk0WLaUAdn689aCwoqbBJiSnjAK/l8WvCWPIPm49" crossorigin="anonymous"></script>
<script src="https://cdn.jsdelivr.net/npm/bootstrap@4.1.3/dist/js/bootstrap.min.js" integrity="sha384-ChfqqxuZUCnJSK3+MXmPNIyE6ZbWh2IMqE241rYiqJxyMiZ6OW/JmZQ5stwEULTy" crossorigin="anonymous"></script>


<body style="background-image: url('Image/bg_music.jpg');background-size: contain;"> 
    <div class="row" style="margin-top:40px;">
        <div class="col-sm-1"></div>
        <div class="col-sm-10">
            <div class="card" style="background-color:70D0EC;height:550px;"> 
                <label style="color:white;font-size:32px;margin:auto;font-weight:bold;" id="label_data"></label>
            </div>      
            <div class="row" style="margin-top:30px;">
                <div class="col-sm-1">
                    <button type="button" class="btn btn-success btn-lg" style="height:70px;width:70px;font-weight:bold;font-size:24px;" onclick=function_Click(2)><b><<</b></button>
                </div>
                <div class="col-sm-10">
                    <center><label style="color:red;font-size:50px;font-weight:bold;" id="label_number"></label></center>
                </div>
                <div class="col-sm-1" style="margin-left:0px;">
                    <button type="button" class="btn btn-success btn-lg" style="height:70px;width:70px;font-weight:bold;font-size:24px;" onclick=function_Click(1)><b>>></b></button>
                </div>                    
            </div>
        </div>
    </div>
</body>
<script>
    var NumData=-1;
    window.addEventListener('load', (event) => {
        function_Click(1)          
    });
    function function_Click(Type){
        if(Type==1){
            if(NumData<19){
                NumData++;    
            } 
        }else{
            if(NumData>0){
                NumData--;    
            }          
        }
        var Data=<?php echo $Data=$_GET['Data']; ?>;
        console.log(Data)
        if(Data==1){
            let array_list  = [ 
                '<label style="color:red;font-size:50px;">เพลง ดาวหางฮัลเลย์</label> <br>ขออยู่ในชีวิตที่เหลือของเธอได้ไหม<br>อยากลืมตาแล้วได้พบเธอจนวันสุดท้าย<br>อยากเป็นคนที่ได้นอนดูดาวข้างเธออีกหมื่นวัน<br>และเอนไปจุมพิตเธอสักล้านครั้ง<br>อยู่กับฉันไปนาน ๆ นะเธอ',
                '<label style="color:red;font-size:40px;">เพลง รักแรก</label> <br>เธอสบายดีไหม<br>เป็นคำถามที่ยังคงวนอยู่ซ้ำ ๆ<br>อยากรู้แค่เพียงเธออยู่ตรงนั้น ที่ไม่มีฉัน<br>ชีวิตเธอเป็นไง<br>คิดถึงกันบ้างไหม<br>ส่วนฉันก็คิดถึงเธออยู่ซ้ำ ๆ<br>ก็หวังแค่เพียงเธออยู่ตรงนั้น<br>จะสุขใจกว่าฉัน<br>อยากให้เธอยิ้มได้เหมือนเก่า<br>เหมือนตอนเรารักกัน',
                '<label style="color:red;font-size:50px;">เพลง เพื่อนเล่น ไม่เล่นเพื่อน</label> <br>ถ้าเธอให้ฉันเป็นเพื่อนเล่น<br>อย่าเล่นเกินกว่านั้นได้ไหม<br>ถ้าฉันเล่นเกินเส้นไป<br>เธอรับได้ไหม<br>ช่วยบอกฉันสักทีว่าที่ฉันยืน<br>เธอยืนที่เดียวกันไหม<br>หยุดเล่นเกินเพื่อนเล่น (หยุดเล่นเกินเพื่อนเล่น)',
                '<label style="color:red;font-size:50px;">เพลง สองใจ</label> <br>ใครจะอยากเป็นคนไม่ดี<br>ผิดที่ใจไม่จำว่ามันไม่ควรรักใคร<br>เจ็บที่ใครๆ เขาก็มองว่าเราหลายใจ<br>เกลียดตัวเองจริง ๆ ที่ฝืนหัวใจไม่ได้<br>ฉันยอมสองใจพราะรักเธอ',
                '<label style="color:red;font-size:50px;">เพลง วัดป่ะหล่ะ</label> <br>เขารักเธอเท่าไร ฉันรักเธอมากกว่า<br>ไม่รู้ว่าเท่าไร but I love you more<br>เขาให้เท่าไร (เขาให้เท่าไร)<br>จะให้มากกว่านั้น (ฉันแน่ใจ)<br>อยากจะท้ามีใครให้มากกว่าฉัน<br>วัดกันเลยฉันคงไม่แพ้',
                '<label style="color:red;font-size:50px;">เพลง แปะหัวใจ</label> <br>แปะหัวใจเอาไว้ข้างล่างใน comment<br>เผื่อว่าใครได้เห็นเขาจะได้ไม่คิดไปไกล<br>ก็รู้ไม่ได้เป็นอะไรกัน<br>แค่ไม่ค่อยชอบเวลาใครมาใกล้เธอ<br>แปะหัวใจเอาไว้แทนคำว่าคิดถึง<br>ความรู้สึกที่มีให้เธอมันมากเกินไป<br>ยังไม่รู้พรุ่งนี้เป็นไง<br>แต่ที่รู้คือวันนี้จะบอกเธอไว้ว่าคนนี้ฉันจอง',
                '<label style="color:red;font-size:50px;">เพลง ทน</label> <br>พี่ไม่มี Louis Vuitton<br>มีแต่หนี้ก้อนโต<br>นวลน้องคงน้ำตานอง<br>เพราะต้องช่วยพี่ออกค่าคอนโด<br>อยู่กับพี่น่ะมันลำบากนะ<br>หรือว่าน้องจะทน<br>อยู่กับพี่ลำบากนะ<br>หรือว่าน้องจะทน<br>',
                '<label style="color:red;font-size:50px;">เพลง ฉลามชอบงับคุณ</label> <br>ฉลามน่ะชอบงับคุณ<br>ส่วนผมน่ะชอบคุณงับ (งับคุณ)<br>แบบว่าผมแค่หลงรักคุณ<br>ไม่เคยเป็นมาก่อน<br>ถูกใจเธอคนนี้น่าดู<br>โอ้ เบบี้โอนลี่ยู<br>แค่ได้มองก็ทำให้ใจผมละลาย (โอ้โอ้ย)',
                '<label style="color:red;font-size:50px;">เพลง เกินปุยมุ้ย</label> <br>อยากเป็นแฟนแต่ได้แค่เพื่อนคุย<br>เฮ้ย มันจะเกินปุยมุ้ย<br>เป็นให้เธอทุกอย่างแล้ว<br>เธอไม่เคยมีฉันบ้างเลย (รึเธอ)<br>อยากเป็นแฟนแต่ได้แค่เพื่อนกัน<br>เฮ้ย! มันจะเกินไปมั้ง<br>แบบว่าใจมันอยากถาม<br>ได้แค่เพื่อนเท่านี้เกินปุยมุ้ยเธอ',
                '<label style="color:red;font-size:50px;">เพลง คาเฟอีน</label> <br>คาปูชิโน่ เอสเปรสโซ่ อาราบิก้า โรบัสต้า<br>อะไรดีนะ มอคค่า ซุปเปอร์ริช อย่าคิดนาน<br>หรือปาท่องโก๋ปากซอยบ้าน<br>เฮ้ ลาเต้ ลาเต้ คอฟฟี่คอฟฟี่ คาเฟอีน<br>เฮ้ เฮ้ ร่างกายต้องการคาเฟอีน',
                '<label style="color:red;font-size:50px;">เพลง เฮอร์ไมโอน้อง</label> <br>อยากเป็นเฮอร์ไมโอนี่จะเสกให้พี่มารักแต่หนู<br>จะทำให้พี่ได้รู้ว่ารักกับหนูจะฟินไม่ไหว<br>หนูไม่มีมนตร์วิเศษ หนูมีก็แค่หัวใจ<br>ถ้าท่องคาถาว่า รักพี่รักพี่รักพี่ หมดใจ<br>พอเสกให้รักได้ป่ะ',
                '<label style="color:red;font-size:50px;">เพลง คนไม่คุย</label> <br>เราลองเป็นแฟนกันเลยได้ไหม<br>ก็เพราะฉันเป็นคนไม่คุย (คุยไม่เป็น)<br>อยากจะอยู่ข้างเธอเงียบ ๆ แค่นี้ (Till the end)<br>พูดไม่แยะก็คนอย่างฉันมันพูดไม่เยอะ<br>พูดแค่นั้นแต่คน ๆ นี้ก็จะมีแค่เธอ<br>รักได้รึเปล่า รักได้รึเปล่า<br>พูดไม่เก่งแต่มันรักจริง<br>',
                '<label style="color:red;font-size:50px;">เพลง ซูลูปาก้า ตาปาลาเฮ้</label> <br>และฉันขอแค่เธอได้โปรดฟังไว้<br>ว่าฉันไม่เคยที่จะหายไปหายไป<br>คิดถึงเพียงแต่เธอรู้ไหม<br>ขอให้เธอรับรู้เอาไว้<br>ว่าฉันไม่เคยที่จะสนใจผู้ใด<br>หมดทั้งใจแค่เธอไม่เคยเปลี่ยน',
                '<label style="color:red;font-size:50px;">เพลง เด็กมีปัญหา</label> <br>เด็กมีปัญหา หา หา<br>ช่วยไม่ได้เลยเธอ<br>ปล่อยไปต้องเผลอๆๆ<br>เที่ยวไปรักใครๆ<br>ก็เลยต้องหา หา หา<br>คนมาควบคุมใจ<br>เป็นเธอได้ไหมยัยๆ<br>ช่วยมารัก รักกัน ก็จะดี ',
                '<label style="color:red;font-size:50px;">เพลง พรปีใหม่</label> <br>สวัสดีวันปีใหม่พา<br>ให้บรรดาเราท่านรื่นรมย์<br>ฤกษ์ยามดีเปรมปรีดิ์ชื่นชม<br>ต่างสุขสมนิยมยินดี<br>ข้าวิงวอนขอพรจากฟ้า<br>ให้บรรดาปวงท่านสุขศรี<br>โปรดประทานพรโดยปรานี<br>ให้ชาวไทยล้วนมีโชคชัย',
                '<label style="color:red;font-size:50px;">เพลง ถ่านไฟเก่า</label> <br>เพราะว่าเธอและเขา<br>ถ่านไฟเก่ายังร้อน<br>รอวันรื้อฟื้น (ฮ้า)<br>แล้วคนมาทีหลังต้องทนต้องฝืน<br>อย่างฉันคนนี้<br>เธอต้องบอกวิธีให้ทำใจ',
                '<label style="color:red;font-size:50px;">เพลง แพ้ใจ</label> <br>เก่งมาจากไหน<br>ก็แพ้หัวใจอย่างเธอ<br>เมื่อไหร่ที่เผลอ<br>ยังนึกว่าเธออยู่ในฝัน<br>ยังมีอีกหรือ<br>รักแท้ที่เคยเสาะหามานาน<br>วันนี้เป็นไงเป็นกันจะรักเธอ',
                '<label style="color:red;font-size:50px;">เพลง ใจสั่งมา</label> <br>ก็เลยมาร้อง เพลงบอก<br>แค่อยากให้เธอนั้นเข้าใจ<br>ไอ้สิ่งที่ฉันทำลงไป ใจสั่งมา<br>อย่าโกรธเลยน้าคนดี<br>ยกโทษให้ฉันนะแก้วตา<br>คราวหลังจะไม่มา จะไม่โทร',
                '<label style="color:red;font-size:50px;">เพลง แฟนจ๋า</label> <br>แฟนจ๋าฉันมาแล้วจ้ะ<br>อยู่นี่แล้วน่ะ<br>เขยิบมาใกล้ใกล้<br>อะตาลาวา<br>อะแฟนจ๋าเราเป็นเนื้อคู่<br>รักจริงไม่อู้<br>โอ้แม่ยอดชู้<br>อะตาลาลา',
                '<label style="color:red;font-size:50px;">เพลง เลือกได้ไหม</label> <br>แล้วฉันเลือกอะไรได้ไหม<br>เลือกให้เธอไม่ไปได้หรือเปล่า<br>หากไม่ยอมให้ไปจะตามใจฉันหรือเธอ<br>ฉันจะเลือกให้เธอเลือกฉัน<br>ไม่ให้ไปกับเขาได้หรือเปล่า<br>สิ่งที่เธอถามมาให้ตอบอย่างไรได้เล่าเธอ<br>ก็ไม่มีทางให้เลือกเลย'
            ];
            document.getElementById('label_data').innerHTML=array_list[NumData];
        }else if(Data==2){
            let array_list  = [  
                '<label style="color:red;font-size:50px;">เพลง เหลวไหล</label> <br>เหลวไหลจริงจริงเลย<br>เหลวไหลทุกทีเลย<br>เหลวไหลจริงจริงเลย<br>เหลวไหลทุกทีเลย<br>เหลวไหลจริงจริงเลย',
                '<label style="color:red;font-size:50px;">เพลง อยากให้อยู่ด้วยไหม</label> <br>เธออยากให้ฉันอยู่ด้วยไหม<br>อยากให้ฉันอยู่ด้วยไหมเธอ<br>จนกว่าที่เจ็บที่เจอมานั้น<br>มันจะบรรเทา',
                '<label style="color:red;font-size:50px;">เพลง ไม่ต้องมีคำบรรยาย</label> <br>ไม่ต้องมีคำบรรยายใด ๆ สักคำให้ลึกซึ้ง<br>ไม่ต้องบรรยายอะไรให้สวยเลิศเลอ<br>ไม่ว่าอะไรมันคือเหตุผลที่ฉันนั้นรักเธอ<br>ให้รู้ว่ารักเธอเท่านั้นพอ',
                '<label style="color:red;font-size:50px;">เพลง คิดถึงฉันไหมเวลาที่เธอ</label> <br>คิดถึงฉันไหมเวลาที่เธอ<br>ไม่เจอะเจอกันกับฉัน<br>คิดถึงฉันไหมเวลาที่เธอ<br>เหงาใจ<br>คิดถึงฉันไหมเวลาที่เธอ<br>ไม่มีใครให้ทะเลาะ<br>ไปไหนแล้วไม่มีไหล่ให้เกาะ<br>แล้วเธอคิดถึงใคร',
                '<label style="color:red;font-size:50px;">เพลง รบกวนมารักกัน</label> <br>หากไม่ดูเป็นการรบกวน<br>ก็จะชวนเธอมารักกัน<br>ถูกใจเธอมาตั้งนานรู้ไหม<br>หากเต็มใจจะโดนรบกวน<br>ก็จะชวนมารวมหัวใจ<br>ก็คิดว่าช่วยหน่อยก็แล้วกัน',
                '<label style="color:red;font-size:50px;">เพลง ไสว่าสิบ่ถิ่มกัน</label> <br>ไสว่าสิบ่ถิ่มกัน<br>ไสว่าสิมีกันและกัน<br>ไสว่าสิฮักแพงกัน<br>ไสว่าสิมีกันตลอดไป<br>ไสว่าสิบ่ถิ่มกัน<br>ไสว่าสิมีกันเรื่อยไป<br>ไสว่าสิบ่แบ่งใจ<br>ไสว่าสิมีแค่เฮา',
                '<label style="color:red;font-size:50px;">เพลง คนบ้านเดียวกัน</label> <br>คนบ้านเดียวกัน<br>แค่มองตากันก็เข้าใจอยู่<br>รู้ว่าเหนื่อยแค่ไหน<br>ว่าหนักแค่ไหนบนหนทางสู้<br>ยังมีคำปลอบโยน<br>ยังมีคำปลอบใจ<br>มีคำว่าซำบายดีบ่ให้กันเสมอ<br>เด้อคนบ้านเฮา',
                '<label style="color:red;font-size:50px;">เพลง เต่างอย</label> <br>สาวเต่างอยรอคอยอ้าย<br>เต่างอยรอคอยอ้าย<br>เต่างอยรอคอยอ้าย<br>เต่า เต่า เต่า เต่า เต่า เต่า เต่า เต่า<br>เต่างอย เต่างอย เต่างอย<br>เต่า เต่า เต่างอย<br>',
                '<label style="color:red;font-size:50px;">เพลง วันเกิดฉันปีนี้</label> <br>วันเกิดฉันปีนี้ขอเธอกลับมาได้ไหม<br>ให้เธอกอดฉันเอาไว้อีกครั้ง<br>เหมือนวันนั้นที่เราเคยรักกัน<br>Happy birthday to me<br>ฉันยังรอเธอตรงนี้เสมอ<br>ถึงแม้รู้ว่าเธอคงไม่กลับมา',
                '<label style="color:red;font-size:50px;">เพลง โต๊ะริม</label> <br>เธอมาทำให้ละลาย<br>โดนสาปให้ตายแล้วตายอีก<br>อย่าได้คิดที่จะหลีก ต้องโดนสะกดให้ยิ้ม<br>ยังคงมองภาพที่เธอนั่งอยู่โต๊ะริม ใจฉันปริ่ม<br>เธอเชือดฉันได้นิ่ม ๆ ด้วยรอยยิ้มเธอ',
                '<label style="color:red;font-size:50px;">เพลง นะหน้าทอง</label> <br>ฉันจึงเป่าคาถาเพื่อให้เธอหลงใหล<br>ให้ทองที่แปะหน้าฉัน ทำให้เธอคลั่งไคล้<br>จะขอเอาความมารักฉันมาผูกไว้ให้ในหัวใจเธอมีแต่ฉัน<br>ฉันจึงเป่าคาถาเพื่อให้เธอหลงรัก<br>ให้ลืมผู้บ่าวเป็นร้อย ที่มันคอยมาทัก<br>และขอให้ความรักนี้ไม่มีเสื่อมคลาย โอมมมม',
                '<label style="color:red;font-size:50px;">เพลง ขาหมู</label> <br>เกลียดความรักที่ทำให้เราต้องเสียใจ<br>แต่ยังค้น ยังคอยจะหามันเรื่อยไป<br>เจ็บไม่จำ ทั้งๆ ที่รู้ สุดท้ายที่รออยู่คืออะไร<br>โอ โว้ โอว',
                '<label style="color:red;font-size:50px;">เพลง ชาติไทย</label> <br>ประเทศไทยรวมเลือดเนื้อชาติเชื้อไทย<br>เป็นประชารัฐ ไผทของไทยทุกส่วน<br>อยู่ดำรงคงไว้ได้ทั้งมวล ด้วยไทยล้วนหมาย รักสามัคคี<br>ไทยนี้รักสงบ แต่ถึงรบไม่ขลาด เอกราชจะไม่ให้ใครข่มขี่<br>สละเลือดทุกหยาดเป็นชาติพลี เถลิงประเทศชาติไทยทวี มีชัย ชโย',
                '<label style="color:red;font-size:50px;">เพลง บุษบา</label> <br>ฉันชื่อบุษบา<br>หน่า-นา-หน่า-น้า<br>หน่า-นา-หน่า-น้า<br>น้า-นา ชื่อบุษบา<br>หน่า-นา-หน่า-น้า<br>หน่า-นา-หน่า-น้า<br>น้า-นา-นา',
                '<label style="color:red;font-size:50px;">เพลง ว่างแล้วช่วยโทรกลับ</label> <br>ไม่ว่างจริงๆ<br>หรือว่ามีคนอื่น<br>ต่อสายเธอทั้งคืน<br>ก็เจอแต่ฮืมฝากข้อความ<br>หายกันไปเลย<br>ไม่รู้มีเรื่องอะไรต้องทำ<br>ได้รับไหมข้อความ<br>ว่างไหมสักนาทีโทรหากัน',
                '<label style="color:red;font-size:50px;">เพลง กรุณาฟังให้จบ</label> <br>กรุณาฟังๆ ฉันให้จบๆๆ แล้วจะบวกจะลบ<br>ก็ตามใจ<br>ถ้าเธอมีเวลา พอให้รบกวนได้<br>ช่วยฟังความในใจ สักนิดนึง',
                '<label style="color:red;font-size:50px;">เพลง ผู้สาวขาเลาะ</label> <br>ซอมเบิ่งอยู่เด้อถ้าหากว่าเธอ<br>นั้นเลิกกันกับเขา<br>เรื่องของสองเฮาสิเป็นไปได้บ่<br>บ่ได้เข้ามาเพื่อกดดัน<br>แต่ว่าฉันนั้นแค่รอ<br>ฟ่าวเลิกกันแหน่เถาะ<br>ผู้สาวขาเลาะ<br>อยากเป็นผู้สาวอ้าย',
                '<label style="color:red;font-size:50px;">เพลง เอาปากกามาวง</label> <br>เธอชอบฉันตรงไหน<br>ให้เอาปากกามาวง<br>ส่วนฉันชอบเธอแบบนี้<br>แบบที่เธอเป็นทุกตรง<br>ชอบที่เธอใจดี น่ากอด<br>และชอบเอาใจทุกเรื่องตลอด<br>และถ้าให้ฉันเลือกข้อเดียว<br>ฉันคงเลือกไม่ลง<br>ขอวงเธอทั้งตัวแล้วกัน<br>I like everything about you',
                '<label style="color:red;font-size:50px;">เพลง วาฬเกยตื้น</label> <br>รักก็คือรัก หลงก็คือหลง<br>ถ้าถามชาวประมง ก็คงไม่เข้าใจ<br>เพราะฉันนั้นเป็นวาฬ<br>ที่เกยตื้นน้ำตาย<br>ใจสลายแหลกลงไปใต้ทะเล',
                '<label style="color:red;font-size:50px;">เพลง เบาเบา</label> <br>คิดถึงฉันสักครั้ง<br>เมื่อไม่ได้คิดถึงใคร<br>ทำตัวตามสบาย<br>ถ้าเจอกันในความฝัน<br>มีเวลาดีๆ<br>ก็บอกให้ฉันได้ฟัง<br>ไม่มากเกินไปกว่านั้น<br>ค่อยๆ รักกันเบาเบา',
                ];
            document.getElementById('label_data').innerHTML=array_list[NumData];
        }
        document.getElementById('label_number').innerHTML=(NumData+1)+ " / 20";
    }
</script>    
		
